// Поліморфізм — це коли один і той
// самий метод працює по - різному
// для різних обʼєктів.
// -------------------------------------
// Приклад:
class Animal {
  speak() {
    console.log("Some sound");
  }
}

class Dog extends Animal {
  speak() {
    console.log("Woof");
  }
}

class Cat extends Animal {
  speak() {
    console.log("Meow");
  }
}

// Метод один — speak()
// але поведінка різна.

// Поліморфізм = одна дія → різний результат
// -------------------------------------
// Абстракція — це приховування складної
// логіки і залишення тільки
// потрібного інтерфейсу.

// -------------------------------------
// Приклад:

class Car {
  start() {
    console.log("Engine started");
  }
}

const car = new Car();
car.start();

Ти просто викликаєш start(),
але не знаєш, як працює двигун всередині.
// -------------------------------------
// Простими словами

// React відслідковує зміни тільки
// через setState.

setCount(count + 1); // ✅

// Ми повідомляємо React, що
// state змінився.

// ----------------------------------
// Важливий момент:

// React порівнює старий і новий state.
// Якщо ти змінюєш напряму, порівнювати
// нічого.
// ----------------------------------
// Підсумок:

// State у React — не змінюється напряму.

// Аби React оновив інтерфейс — використовуй
// setState.
// -------------------------------------

// Пиши в коментарях, що хочеш побачити
// в наступному відео.
