// sessionStorage — це сховище в
// браузері, де можна тимчасово
// зберігати дані.
// -------------------------------------
// Простими словами:

// Це памʼять браузера, яка
// очищається після закриття вкладки.
// -------------------------------------
// Як це працює:

// Поки вкладка відкрита — дані 
// залишаються.
// Закрив вкладку → дані зникли.
// ----------------------------------
// Як зберегти дані:

  sessionStorage.setItem("theme", "dark");
// ----------------------------------
// Як отримати дані:

const theme = sessionStorage.getItem("theme");

console.log(theme);
// ----------------------------------
// Підсумок:

// sessionStorage допомагає сайту 
// тимчасово памʼятати дані.
// -------------------------------------
// Пиши в коментарях, що хочеш 
// побачити в наступному відео.
